// ---------------------------------------------------------------------------------
//   Use greek characters on 1602/2004 LCD screen with arduino or other related MCUs
//
//   Author  : Spyridakis Christos
//   Email   : spyridakischristos@gmail.com
//   Created Date : 12/4/2020
//   Last Updated : 13/4/2020
//  
//   Description: Δυστυχώς λόγο του περιορισμού της μνήμης του HD44780 που βρίσκεται
//                συνήθως σε αυτές τις οθόνες μπορούν να προσθέσουμε μόνο 8 επιπλέον
//                χαρακτήρες, για να γίνει εφικτή η εγγραφή σε ελληνικά. Για αυτόν τον 
//                λόγο μετατρέπεται κάθε ελληνικός χαρακτήρας σε κεφαλαία.
//
//   See: 
//      - [1] https://www.sparkfun.com/datasheets/LCD/HD44780.pdf
//      - [2] https://forum.arduino.cc/index.php?topic=48508.0
//
// ---------------------------------------------------------------------------------

#include <LiquidCrystal_I2C.h>
LiquidCrystal_I2C lcd(0x27, 20, 4);


// Αν χρησιμοποιήσετε την parallel σύνδεση και όχι αυτή με την χρήση του I2C module
// απλά βάλτε σε σχόλια το παρακάτω define
#define I2C

// Το αρχείο για να γίνει εφικτή η μετάφραση των ελληνικών στην οθόνη 
#include "lcd_greek_chars.h"


void setup(){
    Serial.begin(9600);
    lcd.init();
    lcd.backlight();

    // Σε περίπτωση που δεν έχετε δημιουργήσει επιπρόσθετους custom χαρακτήρες [2], αρκεί μόνο κατά τo
    // setup() να χρησιμοποιήσετε αυτήν την συνάρτηση. Σε αντίθετη περίπτωση πρέπει πριν την χρήση
    // της ektypwse() να το χρησιμοποιείτε κάθε φορά.
    createGreekChars(lcd);

    // Για να χρησιμοποιήσετε την ektypese(), περάστε πρώτο όρισμα το object της οθόνης,
    // δεύτερο το κείμενο που θέλετε να εμφανίσετε, τρίτο την σειρά που θέλετε να 
    // εμφανιστεί και τέλος την γραμμή.
    // Μπορείτε με την χρήση αυτής να εμφανίσετε και σύμβολα, αριθμούς ή λατινικούς χαρατήρες.
    ektypwse(lcd, "Γειά σας! Αυτό είναι", 0, 0);
    ektypwse(lcd, "ένα απλό EXAMPLE. Με", 1, 0);
    ektypwse(lcd, "διάφορα σύμβολα $3)#", 2, 0);
    ektypwse(lcd, "@! και χρήση English", 3, 0);
}

void loop(){

}
