// ---------------------------------------------------------------------------------
//   Example: A header file to use Greek Characters on 2004/1602 LCD Screen 
//   (with or without I2C) from arduino or other related MCUs.
//
//   Author  : Spyridakis Christos
//   Email   : spyridakischristos@gmail.com
//   Created Date : 12/4/2020
//   Last Updated : 29/4/2020
//  
//   Description: Δυστυχώς λόγω του περιορισμού της μνήμης του HD44780 που βρίσκεται
//                συνήθως σε αυτές τις οθόνες μπορούν να προστεθούν μόνο 8 επιπλέον
//                χαρακτήρες, οι οποίοι είναι και αναγκαίοι για να γίνει εφικτή η 
//                εγγραφή σε ελληνικά. Για αυτόν τον λόγο μετατρέπεται κάθε  
//                ελληνικός χαρακτήρας σε κεφαλαία ωστέ να μπορεί να γραφτεί
//                οποιαδήποτε ελληνική λέξη.
//
//   See: 
//      - [1] https://www.sparkfun.com/datasheets/LCD/HD44780.pdf
//      - [2] https://forum.arduino.cc/index.php?topic=48508.0
//
// ---------------------------------------------------------------------------------

// Αλλάξτε τον αριθμό των γραμμών και στηλών ανάλογα με την οθόνη που χρησιμοποιείτε
// MHN το παραβλέψετε καθώς χρησιμοποιείται και στην lcd_greek_chars.h
#define ROWS 4
#define COLUMNS 20

// Κάντε include την βιβλιοθήκη που χρησιμοποιείτε για την οθόνη, μπορεί να είναι και
// η απλή βιβλιοθήκη χωρίς την χρήση της I2C
#include <LiquidCrystal_I2C.h>
LiquidCrystal_I2C lcd(0x27, COLUMNS, ROWS);


// Αν χρησιμοποιήσετε την parallel σύνδεση και όχι αυτή με την χρήση του I2C module
// απλά βάλτε σε σχόλια το παρακάτω define
#define I2C

// Κάντε inlcude το αρχείο για να γίνει εφικτή η μετάφραση των ελληνικών στην οθόνη
// Πρέπει το lcd_greek_chars να είναι υπάρχει στον ίδιο φάκελο με το sketch σας
#include "lcd_greek_chars.h"


void setup(){
    Serial.begin(9600);

    // Κάντε όποια πιθανή αρχικοποίηση της οθόνης θέλετε
    lcd.init();
    lcd.backlight();

    // Σε περίπτωση που δεν έχετε δημιουργήσει επιπρόσθετους custom χαρακτήρες [2], αρκεί μόνο κατά τo
    // setup() να χρησιμοποιήσετε αυτήν την συνάρτηση. Σε αντίθετη περίπτωση πρέπει πριν την χρήση
    // της ektypwse() να το χρησιμοποιείτε κάθε φορά.
    createGreekChars(lcd);

    // Για να χρησιμοποιήσετε την ektypese(), περάστε πρώτο όρισμα το object της οθόνης,
    // δεύτερο το κείμενο που θέλετε να εμφανίσετε, τρίτο την σειρά που θέλετε να 
    // εμφανιστεί και τέλος την γραμμή.
    // Μπορείτε με την χρήση αυτής να εμφανίσετε και σύμβολα, αριθμούς ή λατινικούς χαρατήρες.
    // Σε περίπτωση που το κείμενο είναι μεγαλύτερο από το μέγεθος της γραμμής μεταφέρεται αυτόματα
    // η συνέχεια του στην επόμενη γραμμή αν αυτό είναι εφικτό.
    ektypwse(lcd, "Γειά σας! Αυτό είναι", 0, 0);
    ektypwse(lcd, "ένα απλό EXAMPLE. Με", 1, 0);
    ektypwse(lcd, "διάφορα σύμβολα $3)#", 2, 0);
    ektypwse(lcd, "@! και χρήση English", 3, 0);
}

void loop(){

}
